


# 联系方式

- 手机 xxx-xxx-xxx
- Email：xxx
- 微信号：xxx

---
# 个人信息

 - xxx/男/xxx
 - 本科/浙江科技学院/信息管理
 - 工作年限：5年
 - 技术博客：https://www.rebby.cn
 - Github: https://github.com/oidwuhaihua
 
 - 期望职位：Java研发工程师
 - 期望薪资：面谈
 - 期望城市：广州

---

# 自我介绍
 热爱IT技术，喜欢看书和研究新技术，喜欢和别人交流和技术分享。研究过一些常用的开源框架和核心代码。对系统瓶颈以及性能优化等有强烈的兴趣。责任心强。具有良好的沟通能力和团队协作能力。努力、勤奋、执着是我对自己人生永远的要求。



## 广东南粤银行 （ 2015年5月 ~ 至今 ）

### 南粤手机银行
**银行** ：南粤手机银行<br/>
**我的工作是** 负责系统功能开发/开发测试环境维护/以及生产性能问题排查与监控。系统整体架构采用ESB架构 实现分布式部署。我们系统属于面向用户的，前端系统通过netty对接部分核心系统，我在完成业务功能开发的情况下，同时通过shell脚本实现一键打包部署。一次系统上线出现整体系统缓慢以及导致系统宕机，我在线上通过jstack,jmap,jstat分析线程状态以及JVM内存回收生命周期，在线下测试环境通过Jmeter压测，同时通过Java Viratul 、Jconsole远程监控服务器/JVM并且定位出问题（[分析文章](https://www.rebby.cn/2016/12/08/gc/)）。同时在线上通过手动编译实现了ApacheTLS1.2的升级。




### 南粤手机考勤系统
**手机考勤系统** ：由于公司需求需要实现线上打卡。<br/>
**我的工作是** 负责整体架构设计与研发，功能包括：前端打卡签到/签退，后端查询/统计分析。由于都是外网手机打卡，需要通过Apache反向代理以及域名映射。目前在虚拟机(contos)环境4核16G内存的情况下，在druid的监控下高峰期支持300多的并发。



## 广东铭道电子商务有限公司 （ 2014年8月 ~ 2015年5月 ）

### 邻里商城
**商城** ：邻里商城是是一个专业经营网络营销业务的网站。<br/>
**我的工作是** 负责超值购的开发，超值购 是一种全新的直销模式,通过分享和购买超值购发展一度人脉、二度人脉、三度人脉。由于公司某原因公司架构需要整改，我参与了系统架构dubbo的研究与实施。在网站开发中通过dubbo实现了模块碎片化,实现了分布式服务治理。为了提升效率一些数据存储我们采用了redis。



## 广州科腾信息技术有限公司  （ 2012年12月 ~ 2014年7月 ）

### 广州供电局 停电监控系统
**电力项目** ：停电监控系统是对广州所有区局**大面积停电**时影响了多少用户以及设备，出动了多少班组人员抢修,进行监控并且以地图挂牌渲染形式呈现。<br/>
**我的工作是** 负责全景展示，点击停电展示，以及前端框架选型研究。由于页面地图是GIS实时展示，后端使用springmvc定时通过**mybatis**去数据库订阅一批数据 以**DWR**与后端交互异步呈现到前端,由于需求问题，前端框架更换了几套包括：Jquery/Ext 3.x/DHTMLX/Extjs4.x 而我负责前端框架研究，也学到了前端框架都大同小异。


### 广州供电局 配网生产管理系统<br/>
**电力项目**： 配网系统是针对广州所有用户，设备，供电使用情况，电力人员进行管理，并且对接所有子系统 以及保证数据集中分析的一个核心业务平台。<br/>
**我的工作是** 负责跳闸管理的开发，顾名思义就是对广州所有用户**跳闸信息进行统计**，以及 **申报流程**。首先数据是通过线下调度值班员收集的，收集后的数据是在**快速复电系统中**,当快速复电录入一条信息 通过**触发器(trigger)** 增加一条标示记录,配网系统定时通过**WebService** 去查**标示记录**，如果发生改变就通过WebService同步到当前系统中，跳闸记录是否属实，需要通过领导层层审批，并且通过**JBPM** 呈现。由于统计粒度比较细,牵扯的表有比较多实现非常麻烦(为此还在网上报了oracle培训班)，具体实现用了大量的cace when and 分析函数如：sum,dense_rank,count,decode,nvl ，开发过程中也理解了标量子查询会导致笛卡尔积问题，尽量改用left join，尽量避免全表扫描。


## 开源项目

 - [Dm-framework](https://github.com/oidwuhaihua/reb-rpc) : 是一个集成spring通过netty为核心实现的远程通信框架，并且支持定制的xml报文协议，以后会支持多种报文协议，目前正在完善中。
 - [https://www.rebby.cn](https://github.com/oidwuhaihua/reb-rpc) : 通过 nodejs+hexo+Apache+TLS+Tomcat搭建的个人博客。


# 技能清单

以下均为我熟练使用的技能

- Web开发：Java/python/shell
- 服务器：Nginx,Apache,Tomcat,weblogic
- Web框架：springmvc,mybatis,hibernate,struts,dubbo,netty
- 前端框架：Jquery/DHTMLX/ExtJS/
- 开发工具：eclipse/IntelliJ IDEA/Jmeter
- 开发环境：linux/mac/window
- 数据库相关：MySQL/Oracle/Redis/Mencached
- 版本管理:Svn/Git
- 单元测试：Unit
- 云和开放平台：/微信应用开发/小程序/ECS/


---

# 致谢
感谢您花时间阅读我的简历，期待能有机会和您共事。<br/>[线上简历]("https://github.com/oidwuhaihua/oidwuhaihua.github.io")
